In [15]:
library(dplyr)
library(readxl)
library(writexl)

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [27]:
df1<-read.csv('./데이터/02-df01.csv')
df2<-read_excel('./데이터/02-df02.xlsx')
df3<-read.csv('./데이터/02-df03.csv')
df4<-read.csv('./데이터/02-df04.csv')

In [28]:
head(df1)
head(df2)
head(df3)
head(df4)

  NAME     AGE SMOKE
1 Kim      56   TRUE
2 James    34  FALSE
3 Yamamoto 12  FALSE

  NAME      AGE SMOKE
1 Katherine 78   TRUE
2 Nicolas   45  FALSE

  SEX NATIONALITY
1 M   Korea
2 F   United Kingdom
3 M   Japan
4 F   United States
5 M   France

  CITY     NAME
1 New York Katherine
2 Seoul    Kim
3 London   James
4 Moscow   Zakhaev

In [31]:
df5<-rbind(df1, df2)

In [32]:
df6<-cbind(df5, df3)

In [35]:
merge(df6, df4, all=TRUE)
merge(df6, df4, all=FALSE)
merge(df6, df4, all.x=TRUE)
merge(df6, df4, all.y=TRUE)

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul
4 Nicolas   45  FALSE M   France         NA
5 Yamamoto  12  FALSE M   Japan          NA
6 Zakhaev   NA     NA NA  NA             Moscow

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul
4 Nicolas   45  FALSE M   France         NA
5 Yamamoto  12  FALSE M   Japan          NA

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul
4 Zakhaev   NA     NA NA  NA             Moscow